Repository: eunhyekoo/glo_project
Catalog: feedback/TMData/[Naver] WEBTOON ID>EN Who's Mr. President.tmx
Source language: id
Languages: en

source: SAYA RASA PERTEMANAN KAMI TIDAK SEPERTI DIBUAT-BUAT...
en: I feel like our friendship is real...

source: Ada di balik tembok.
en: he’s behind that wall.

source: HA?
en: Huh?

source: Manisnya!
en: So cute!

source: KEJADIAN TEMAN-
en: the incident with

source: Baiklah, baiklah, Biar Paman lakukan sesuatu…
en: okay, okay. I’ll do something.

source: KESALAHAN
en: They

source: CHIARA ADALAH
en: Chiara is

source: NGOMONG
en: What are

source: AKU DENGAR-
en: I heard that yesterday

source: TAPI KEGIATAN SEKOLAH DAN TUGAS OSIS SAJA SUDAH CUKUP BANYAK MENYITA PIKIRANKU,
en: since I’ve already had a lot on my plate with school and osis duties,

source: TELEPON… KALIAN
en: a call. You guys

source: TAPI ITU ARTINYA KAU TIDAK MEMBERI RUANG PADA WAKATOS!!
en: but it means that you didn’t give the vice president her space!

source: BENAR 'KAN,
en: what do you say,

source: WAKTU KETUA LEO DAN
en: when Leo was hitting on

source: CUKUP RUMIT.
en: family.

source: YANG MAU AKU
en: the scenario I’m about to

source: CHIARA TIDAK AKAN
en: is in ruins

source: AKU PIKIR SUDAH
en: Well, it’s been a while

source: MEMBAYANGKANNYA
en: just imagining it

source: MEMBAWAKAN PROPERTI
en: was asked to bring the props to

source: DENGAN KETUA EKSKUL
en: leader of the

source: jadi keterusan…
en: chiara...

source: INI JUGA 'KAN
en: You’re in the wrong

source: KARENA ITULAH TADI
en: That’s why

source: KUPIKIR INFO
en: I thought you really had some valuable info,

source: BURUK…
en: worse...

source: KAU INI
en: What were you trying

source: KITA BISA
en: I’m willing to

source: KAMI BISA MEMASTIKAN
en: we can ensure

source: ITU KARENA
en: Because

source: …INI BUKAN
en: This...

source: belakangan ini
en: ordering me

source: SEKOLAH INI MEMANFAATKAN
en: the school has been using

source: PESH~
en: whoosh

source: KAMU TIDAK
en: You shouldn’t

source: TIBA-TIBA, NANTI
en: she will be

source: Apakah itu tidak membuat Chiara merasa tidak menjadi bagian di mana pun?
en: don’t you think she will feel like she doesn’t belong anywhere?

source: Berarti tujuan si pelaku adalah mengurangi pengawasan sekolah di area lain..?
en: does it mean that the perpetrator's goal is to reduce school supervision in other areas?

source: SELAMA INI AKU
en: all this time...

source: SESAMA PARTNER
en: each member

source: GAK SI KACAMATA,
en: spooling nonsense!!!

source: SITUASI SEKARANG
en: that the situation

source: TERJADI,
en: going on,

source: TAPI ADA BEBERAPA
en: But, there are exceptions,

source: ITU…
en: Isn’t she...

source: KENAPA BAPAK MENJADI GURU DENGAN KARAKTER BAPAK ITU??
en: why do you become a teacher with such character?

source: KALAU KALIAN TIDAK BERNIAT BURUK.
en: I believe you have no ill intention.

source: MURID BEASISWA SEBAGAI
en: student as

source: RUANG OSIS
en: OSIS

source: HEI, LEO!
en: Hey, Leo!

source: SUDAH TAHU, BUKAN?
en: know...

source: HOI…
en: Oi...

source: BARU…
en: sir!

source: …Umm Kak Chira, Cantika penasaran deh…
en: um chiara, I was curious...

source: YANG BAIK!!
en: girl!

source: ON SCREEN DI
en: You’ll be on-screen

source: pesan berturut-
en: with multiple

source: KERJAANNYA CUMA
en: You worthless-! stop

source: DI SEKOLAH INI
en: spread like wildfire

source: BENERAN GAK SADAR
en: realized this? or

source: MULAI BICARA.
en: start talking.

source: ADA KABAR
en: Are there

source: T-TAPI KITA SEMUA TAHU KALAU PAK NEV SANGAT MENGHORMATI KEPSEK!
en: b-but we all know that mr. nevada has the utmost respect for the principal!

source: KAMU TIDAK BISA
en: haven’t been able

source: BISA MENGHABISKAN
en: spend some more

source: MENCARI TAHU TENTANG
en: she’d been digging up some information

source: MEMPERCAYAIKU,
en: trust me,

source: spasi
en: space

source: AH IYA, SOAL ITU..!
en: Oh, right, about that!

source: Padahal pukulan dari istrinya tadi masih belum sembuh!
en: the slap from his wife hasn’t even healed yet.

source: INI BISA KITA
en: this

source: PANIK.
en: was panicking.

source: MEMANCING EMOSI
en: always grinds

source: APA MUNGKIN KEPSEK MEMBIARKAN ORANG YANG TERLIBAT DENGAN HAL SEPERTI ITU MENJADI GURU DI KRISOPRAS?
en: do you think the principal would let someone from the sanjaya family become a teacher in krisopras high?

source: ITU
en: That’s

source: DIMANFAATKAN?
en: used by the real culprit?

source: KALAU AKU KETUA OSIS??
en: the president of OSIS?!

source: Wah…
en: whoa...

source: AKU HANYA MEMIKIRKAN
en: I’ve only been thinking

source: BEGITUKAH-
en: Oh, I see...

source: Kau pikir aku juga mau ditemani olehmu?
en: Do you think I want you here?

source: TAPI KAMU HARUS BILANG JUGA YA, SOAL INI KE PAK NEV.
en: but you have to tell mr. nevada about this.

source: KAMU MUDAH SEKALI
en: to be more

source: KETUA & WAKIL
en: President & Vice President

source: SISWA.
en: there.

source: TUGASNYA TANPA
en: to do without

source: WAH…
en: well...

source: KAMU DISKUSIKAN
en: Discuss it

source: BANGET!!
en: gears!

source: CINTA ITU
en: I know

source: KEMARIN,
en: reporter.

source: YANG SEBENARNYA
en: really cares about

source: KITA TIDAK
en: well...

source: Ukh..Cantika, maafkan Kakak ya…
en: Uh... cantika, I’m so sorry...

source: AKU BISA MENGURUS DIRIKU SENDIRI,
en: I can take care of myself,

source: WAJAHNYA
en: He’s always

source: BU NINA?
en: Ms. Nina’s sake?

source: P-PAK NEVADA!!
en: Mr. Nevada!

source: APA KAMU PUNYA
en: Do you have plans

source: DAN INI PUN
en: This also

source: UNTUK MENGOREK
en: to dig up

source: DIJAUHI OLEH
en: my friends

source: Keras apanya?
en: harsh?

source: WAKATOS ITU
en: chiara for help

source: Dan kau memintaku jadi double agent?
en: and you asked me to be a double agent.

source: KAU HARUS,
en: you should thank me.

source: SESUATU,
en: something,

source: Apa kamu sudah mempersiapkan
en: have you

source: TIDAK APA KAK,
en: No, I don’t mind.

source: UNTUK BERHATI-HATI DENGAN
en: to be careful

source: KARENA ITU DIA
en: That’s why she

source: TAHU APA YANG SEDANG
en: to know about what

source: DUDUK DI SINI
en: with you

source: KALAU SEDANG NAHAN
en: whenever he needs

source: gimana..?
en: I do?

source: BUKAN??
en: right?!

source: APA PERLU KAU
en: is this

source: MEMBUATMU MERASA
en: to make you feel bad or

source: KURANG LEBIH BEGITULAH YANG TERJADI.
en: that’s what happened, more or less.

source: DRRT-
en: Bzzt

source: BISA MEMBERINYA.
en: to you.

source: SEPERTI YANG
en: As

source: AH, AKU RASA SIH TIDAK ADA MACAM-MACAM, APALAGI DIA KERABATNYA PAK NEV.
en: I don’t see anything fishy about him, especially since he’s a distant relative of mr. nevada.

source: HARUS KUMATIKAN...
en: I must turn it off...

source: PEDULI DENGANMU,
en: you,

source: DULU AGAR BISA
en: for a while so you

source: KAITANNYA DENGAN
en: whatsoever with

source: BENAR JUGA,
en: That’s true!

source: MERASA PERLU
en: need

source: ASAL TUJUANNYA BAIK, AKU TIDAK BISA MENCEGAH SIAPAPUN MENDEKATINYA.
en: after all, I have no right to prevent anyone from approaching her.

source: TERHITUNG RAJIN
en: I’m a diligent

source: OSIS DI BIDANG YANG
en: of members

source: aneh?
en: a weirdo?

source: itu terlalu
en: is

source: MEMANG BAGIAN
en: a part

source: MENANYAKAN
en: to ask her

source: TIN-
en: pun

source: anggota teater,
en: bringing the props,

source: KE SINI UNTUK
en: to talk

source: KENAPA BUKAN KEPSEK
en: Why isn’t it the headmaster or Mr. Nevada

source: HOI, HOI,
en: Oi, Oi,

source: bukan orang
en: just

source: KAMU TIDAK PERNAH MENCARI TAHU TENTANG PAK NEV?
en: you’ve never looked into him?

source: ITU APA??
en: what?

source: SESUATU, NANTI
en: It’ll only make

source: SEJAK TADI JELAS-
en: from the beginning,

source: DAN AKU
en: She won’t

source: balik sampai soal
en: to think back to

source: P-pak Nev dan Kepsek!?
en: oh, mr. nevada and mr. principal!

source: ITU,
en: it every time

source: BAIKLAH,
en: Well, then,

source: MENCURIGAKAN.
en: should also be investigated.

source: dengan tatapan
en: looking at me

source: INI..?
en: he done?

source: DULUAN AJA DEH.
en: go on ahead.

source: GUNAKAN,
en: info...

source: KENAPA SIH SEKOLAH
en: Shouldn’t they

source: BEGITUKAH…
en: I see...

source: CEPAT YA…
en: here...

source: KAU TIDAK
en: You won’t

source: Halo?
en: hello?

source: DANGKAL,
en: real...

source: YA, SAMPAI TIDAK
en: you didn’t even

source: SALAH, BODOH.
en: better, doofus.

source: SESUATU YANG
en: I’m

source: BAIK?
en: you.

source: Cantika jadi terlibat…Kamu pasti takut, ya?
en: I brought you into this... you must be scared...

source: ABSURD SEKALI.
en: being absurd.

source: TANPA RASA
en: If there’s no trust

source: TANPA MENYINGGUNG PAK NEV!??
en: without offending him!

source: SEPERTINYA SUDAH WAKTUNYA SAYA MENGUNJUNGI TEMPAT ITU LAGI.
en: I think it’s time for me to visit that place again.

source: NGAKU SEBAGAI
en: the president

source: SEDANG
en: need

source: PERSIAPAN
en: They do these rituals

source: MENEMUI KAK LEO
en: to accompany you

source: KETUA LEO BISA
en: could execute

source: KITA HARUS MENGAWASI SIAPA YANG MENDEKATI WAKIL KETUA OSIS.
en: that’s when we keep an eye out for anyone who tries to approach the vice president.

source: BISA PERCAYA
en: trust his

source: DENGAN FESTIVAL
en: preparing for the

source: PUNYA AGENDA
en: he has a hidden agenda

source: MELAKUKAN
en: do

source: TERJADI.
en: that might come up in the future.

source: DIAPAKAN, YA?
en: about him, huh?

source: MENJELASKAN APA-
en: to give Chiara

source: KATAKAN.
en: he said.

source: CERITA ATAU MENERIMA
en: open to talk and ask for

source: RENCANA ORANG
en: your plan, huh,

source: SEKOLAH?
en: school?

source: APA ITU
en: Does this mean

source: BANYAK HAL YANG SEPERTINYA DISEMBUNYIKAN DARI SAYA...
en: it’s as if I’ve been kept in the dark about so many things...

source: KITA SEMUA
en: we have

source: Berhenti menatapku
en: Stop

source: JIKA DIA
en: If we

source: MEMANG ANAK
en: such a nice

source: TERLIBAT DALAM
en: myself

source: MUNGKIN, 'KAN?
en: possible!

source: MEMBERITAHU CHIARA.
en: tell Chiara about everything.

source: SELAMA INI ORANG-
en: people have only been

source: Aku mau diapakan itu!??
en: what are you going to do?

source: DAN TADI
en: and

source: AKU HARUS APA…?
en: What do I do... what do I do???

source: YA, MEREKA JELAS-JELAS MENYUKAIMU.
en: yeah, they obviously like you.

source: DRAP
en: stomp

source: TOK!
en: Tap

source: SEBENARNYA
en: what

source: EH..?
en: Huh?

source: BAYANGANMU, APA
en: you think he is? Shouldn’t

source: Ah, Ezra!!!
en: ezra!

source: UNTUK MEMPROSES
en: process

source: LEWAT, LALU
en: and then

source: EEEH?
en: eh?

source: Kalau Kak Leo tidak datang, apa yang sebenarnya mau Kak Ezra katakan..?
en: if leo hadn’t come, what would ezra have said?

source: YA SUDAHLAH.
en: alright then.

source: 'KAN?
en: do you?

source: BERTERIMAKASIH!
en: so much, Ezra!

source: Kenapa dia meminta Leo memberitahunya lokasi yang ramai di festival, padahal seharusnya dia bisa mengamatinya sendiri..?
en: why did they ask leo to tell them the crowded location at the festival? can’t they see that by themselves?

source: MENGEJAR CINTA,
en: by love,

source: majikannya!
en: pet!

source: MENIMBULKAN KECURIGAAN
en: any suspicion,

source: KELIHATAN SANGAT
en: that this has been

source: Aku akan memberitahu Pak Nev untuk meningkatkan keamanan sekolah.
en: I’ll tell mr. nev to increase the school security.

source: …Sekolah sudah memprediksi kemungkinan kejadian seperti ini di festival.
en: the school has prepared for any possibilities.

source: UNTUK WAKATOS DIMINTA
en: that the vice president

source: Dan mereka mengiring kami ke sebuah mobil dan memaksa kami masuk.
en: ...they told me to get in a car.

source: SEDANG SIBUK?
en: busy?

source: DAN CONTOH
en: The other exception

source: TERNYATA ADALAH
en: ...is none other than

source: HEDWIG UNTUK
en: Hedwig to

source: Ini benar-benar gawat…
en: it’s really bad...

source: YANG MENGIKUTI
en: what follows

source: NAOMI KURANG
en: Shut up,

source: TERINGAT SUATU
en: me

source: SEPERTIMU!
en: you!

source: KITA DIANGGAP TIDAK
en: when they think

source: *Barusan Ezra minta bantuan
en: *Ezra has asked Naomi

source: APA ADA SESUATU
en: Is something bothering

source: BAHKAN SAYA
en: I even violated the

source: ITULAH KENAPA
en: She’s been

source: UKH…
en: Ugh...

source: AKU TIBA-TIBA
en: dragging you

source: BENAR…
en: Yeah...

source: FESTIVAL SEKOLAH.
en: for the festival.

source: ikut-ikutan)
en: want to get involved)

source: CHIARA LAGI BUKAN??
en: on Chiara ever again, right?!

source: YAITU MENGAKU
en: and the plan

source: MAAF YA CHIARA,
en: Forgive me,

source: TAHAN ADLIB -NYA
en: I think we don’t need you to see your ad-lib

source: KAKAKNYA,
en: and his brother,

source: PERCAYA DENGAN
en: trust you,

source: SALAH SATUNYA DENGAN
en: One of the precautions is

source: HALO,
en: Hello!

source: KITA HANYA BISA
en: can do for now

source: Tentu saja tidak apa-apa, Pak Kepsek!
en: it’s totally fine, mr. principal.

source: SEBENARNYA SISWA KELAS
en: and twelfth-graders are

source: SAMPAI MENGHELA
en: day, huh?

source: …TAPI
en: But, does he really have

source: …KENAPA IBU
en: Say something

source: Benar-benar anaknya Pak Nev, mengerikan!!
en: mr. nev’s daughter is really scary!

source: DENGAN ARA DAN ABBY
en: ara and abby?

source: PUNYA HUBUNGAN
en: he’s close with

source: makin merasa
en: really bad

source: J-JADI SELAMA
en: S-so they’ve been...?

source: BIASA, DAN MEREKA TIDAK
en: They wouldn’t care

source: HANYA BEGITU PADA
en: like this

source: SIAPAPUN, BUKAN?
en: right?

source: APA…
en: wh-what...

source: TAPI TADI AKUN
en: But, the school admin

source: PULANG AJA
en: you can go home

source: DI PIHAKMU…
en: your side...

source: AH!!
en: Oh!

source: KONSENTRASI.
en: can concentrate.

source: Sepertinya tadi
en: That was

source: SEKALI TERJADI GESEKAN,
en: conflicts,

source: Kamu
en: oi,

source: BANYAK PERTANYAAN.
en: so many questions.

source: BIASANYA MANA
en: Why would someone

source: ...JADI,
en: well, you know...

source: LEBIH LANJUT,
en: further.

source: KENAPA HARI
en: She’s

source: KE
en: Wanna

source: Pak Nev, apakah Chiara sudah bersama Bapak??
en: mr. nev, is chiara with you?

source: E-EH…?
en: H-huh?

source: DI SEKOLAH INI…
en: here...

source: KEJADIANNYA…
en: the case...

source: EKSKUL TEATER BANYAK
en: theater club members

source: BILANG BEGITU.
en: order, isn’t?

source: OSIS BERBEDA
en: was different

source: SALAH LAGI, SALAH LAGI!!
en: every single thing I do goes awry!

source: NATURAL, BUKAN?
en: doesn’t it?

source: NAMANYA JUGA
en: You’re still a human after all,

source: CHIARA BISA?
en: Can you come too, chiara?

source: APA BAPAK
en: Have you

source: ITU AKAN
en: It would be

source: Ini di luar kemampuanmu, Chiara.
en: this is beyond your capability, chiara.

source: AGAR
en: So that Leo

source: KITA HARUS MENCOBA
en: we need to

source: JADI AKU INGIN
en: So, I thought it’d better

source: AH, KAMU
en: Oh, come on.

source: KELUARGA SANJAYA INI SEPERTI MAFIA, BEGITU MAKSUDMU??
en: are you saying the sanjayas are some kind of mafia?

source: Dia mau bertanya tentang OSIS.
en: She wants to ask you about OSIS.

source: LALU BERIKAN UPDATE
en: then you can update me

source: TIBA WAKTUNYA.
en: come, Sir.

source: SAYA SEMPAT BERPIKIR RENCANA INI GAGAL KARENA EZRA TIDAK MELAKUKAN APA YANG SAYA MNTA.
en: I thought the plan would fail since ezra didn’t do what I asked him to.

source: ADALAH HAL YANG
en: most important

source: Tapi aku tidak pernah memusingkan soal itu karena aku memang sudah paham apa yang akan aku hadapi saat masuk ke sekolah ini.
en: but I never care about that because I knew what I would deal with when I entered this school.

source: SEKALI TIDAK ADA
en: connection

source: MEYAKINKAN.
en: convincing.

source: ALASAN, SEJAK KECIL
en: my mother

source: I-Ini!!
en: t-this!!!

source: Aku menyadari kalau aku berada di level yang sangat berbeda dengan mereka semua,
en: I realize that I’m on a completely different level from all of them.

source: "...TEMUI AKU NANTI DI RUANG OSIS,
en: “...meet me at the osis room...

source: FU FU, KAU AKAN TERKEJUT DENGAN KECEPATANKU.
en: you’ll be surprised to learn how quickly I gather information.

source: WAKATOS DAN MENGATUR
en: so he sets an appointment

source: saya tinggal.
en: I’ve got to go.

source: SEBENARNYA KAU MEMANGGILKU KE SINI UNTUK INI?
en: is that why you asked me to come here?

source: ORANG DI SEKITARMU
en: to the people

source: BUKAN?
en: right?

source: A-Ah, Pak Nevada!
en: u-uh, mr. nevada!

source: HARAP KAMU BISA
en: you can

source: U-umm…Kak Chia, apa itu?
en: u-um... chia... what’s that?

source: AKU TAHU,
en: I know right!

source: NGAPAIN KAU
en: why are you

source: KEPALA SAYA.
en: questions about this.

source: DAN MEMUTUSKAN UNTUK
en: and we’ve decided to

source: TAPI APA JUGA YANG
en: Do I even

source: Saya belum sempat menjelaskan
en: I haven’t had the chance to explain

source: MEMILIKI KAITAN YANG ERAT DENGAN MUSUH KEPSEK, PAK ARDHAN.
en: ...have a close relationship with mr. ardhan, the principal’s nemesis.

source: AKU MEMILIKI
en: I come from

source: LEBIH BAIK PERGI
en: you’d better

source: CHIARA,
en: by now.

source: Padahal Bapak sudah memperingati saya, tapi saya hanya melihat apa yang benar menurut saya…
en: you had warned me, but I only did what I thought was right.

source: adikku, dia
en: my sister,

source: Sering bolos kelas.
en: and he’s frequently skipped class.

source: KENAPA DIA
en: Why’s she pointing

source: VISI YANG SAMA
en: can start to develop

source: TADI AKU
en: Oh, I was

source: AKU HANYA
en: I just

source: MISALNYA…
en: if you want...

source: ANGGOTA OSIS..?
en: member?

source: INI AKAN MENJADI CERITA YANG PANJANG.
en: ...this will be a long story.

source: MENGAKU PADANYA
en: you planning

source: ORANG YANG
en: The one

source: SANGAT LANGKA.
en: rare and valuable.

source: UKH, SEMUA INI
en: Ugh... we wouldn’t be in

source: KALI MEMIKIRKAN
en: think about

source: MENDENGARNYA?
en: the details?

source: IBU.
en: Ms. Nina!

source: PERASAANKU
en: my feelings like this

source: SISWA LEO SUNARDI
en: from 12-A,

source: ATAU SEKOLAH
en: I guess

source: ATAU KARENA
en: Or was it because

source: BERBUAT SEPERTI
en: really

source: JELAS SEKALI KAU
en: You’re obviously

source: KATAMU…
en: did you say?!

source: APA-APA?
en: okay?

source: APA LAGI SIH YANG
en: What are you

source: KETUA OSIS?
en: the president?

source: AKU TIDAK MAU MENDENGARNYA DARIMU!!
en: I don’t wanna hear that from you!

source: JUJUR, RASANYA SEPERTI DIPERMAINKAN.
en: honestly, I feel like I’ve been duped.

source: TUKANG GOSIP, AKU
en: a gossip girl,

source: BRAK!
en: Blam

source: KEMUDIAN SOAL
en: And also about

source: ANU...
en: uh...

source: MARAH KARENA
en: upset because you know

source: …Asalkan aku bisa memastikan Chiara aman, Tidak apa dia harus salah paham untuk saat ini.
en: as long as she’s safe. it’s ok if she misunderstands me for now.

source: TAPI SAAT ITU
en: But, back then,

source: S-Sudahlah, Cantika masih terlalu kecil untuk bicara soal begini!
en: cantika, you’re too young to talk about that.

source: TAPI BUKAN
en: but I don’t think

source: AWALNYA KAMI
en: At first,

source: CHIARA PASTI
en: She must

source: BELAKANGAN INI KAMU
en: I’ve noticed that recently,

source: mengeluh
en: continuously

source: Ah, apa dia mau tanya soal kejadian tadi?
en: is she going to ask about earlier?

source: SOAL KAK LEO?
en: about that Leo guy?

source: sadar??
en: realize it, huh?!

source: AYO KITA
en: Let’s

source: E-EEH??
en: H-huh???

source: T-TADI ITU...
en: I-I, uh...

source: MEMBUATNYA
en: her

source: M-MAAF,
en: s-sorry,

source: ADALAH
en: doubts

source: MEMILIH SAYA SEBAGAI
en: appoint me

source: TAHU?
en: know?

source: K-KEPSEK DAN PAK NEV!??
en: mr. principal and mr. nevada!

source: DAN TIDAK HANYA
en: This also

source: Kenapa
en: Huh?

source: SEBENTAR LAGI SAYA
en: I’m graduating soon,

source: SEKIAN UNTUK
en: Okay. that’s it

source: BICARA DENGANNYA
en: to me

source: DIGOYAHKAN.
en: swayed.

source: BERBOHONG SOAL
en: about

source: APA KAMU MASIH MAU MENDENGARKAN PENJELASAN KAMI?
en: ...do you still want to hear it?

source: YANG TERSEBAR
en: a rumor

source: Bukannya kalian sedang bersama-sama?
en: isn’t she with you?

source: AKU JUGA
en: I’d

source: TIBA-TIBA MENYENDIRI?
en: Aren’t they supposed to be close?

source: KAU TUNGGU??
en: waiting for?!

source: WAKTU LEBIH BANYAK
en: time

source: (Gak mau
en: (don’t

source: 'KAN, KALAU SISWA
en: that Ezra,

source: MAAF,
en: A

source: BICARA APA?
en: to say?

source: HAHH?
en: huh?

source: SAJA DULU PADA
en: focus

source: Yaah,
en: Aww,

source: MASING-MASING.
en: their partner.

source: SEPERTI KAMU.
en: right?

source: PERASAAN SAYA.
en: my feelings.

source: MENGETAHUI SIAPA
en: The identity

source: DENGAN SIKAPMU
en: I still have no idea

source: TIDAK MARAH?
en: that I wasn’t mad at you?

source: SEDALAM INI!??
en: myself into this?!

source: Kau-'kan nge-fans banget?
en: you’re a big fan, right?

source: HAAAH??
en: Huh???

source: YANG KAMU KATAKAN
en: what you said

source: BOLEHKAH… BAPAK
en: Could you

source: WAJAH FOKUS
en: while focusing his face

source: DI SEKOLAH,
en: at school.

source: Naomi untuk menginterupsi
en: to interrupt

source: KETUA OSIS ADALAH
en: that the president

source: Kau sebagai
en: You being an

source: ANEH,
en: Weird...

source: OSIS SEJAK AWAL.
en: about OSIS.

source: S-SAYA SUDAH BILANG BUKAN BEGITU!!
en: I-I told you, it’s just a misunderstanding!

source: KETUA LEO!
en: Leo!

source: MEMBAWA KEUNTUNGAN,
en: you can’t bring anything to the table...

source: SKANDAL.
en: any scandals.

source: Setelahnya dia tiba-tiba dipilih menjadi Wakil Ketua OSIS dan itu membuatnya juga dijauhi.
en: she also got elected as the OSIS vice president, which caused her to get shunned.

source: DITAMBAH LAGI, DIA
en: Moreover,

source: BERBEDA.
en: was little.

source: PANIK
en: frantic

source: MENGGUNAKAN TEMPAT
en: you’ve been using this place

source: CEPAT SELESAIKAN
en: you’d better

source: Karena orang-orang takut dekat dengan OSIS
en: since people are afraid of being close to OSIS members.

source: SEKARANG AKU
en: Now I

source: WAKIL KETUA
en: the

source: DENGAN BEGITU,
en: Therefore,

source: SEBAGAI TEMPAT
en: which has been designated

source: TERLALU MERENDAH!
en: stop with the imposter syndrome nonsense!

source: KESELURUHAN ADALAH
en: is merely

source: E-EH..?
en: H-huh?

source: Kekerasan dalam sekolah,
en: Violence is never the answer.

source: SEBENARNYA AKU BISA MENGERTI KALAU KAMU KECEWA ATAU MARAH,
en: actually, I would understand if you were mad at me,

source: KAGUM…
en: admiration...

source: JUGA BEGITU?
en: or not, right?

source: Papa sering larang Mama ini itu, lalu Mama mengeluh kalau Papa suka mengatur semua sendiri.
en: dad often forbids mom to do stuff and mom complains that dad likes to control everything.

source: MENGAWASI MEREKA…
en: on them...

source: UKH!
en: ugh!

source: MENYURUHMU UNTUK
en: if you’re the one

source: …MERENUNGI
en: contemplating

source: MEMINTAKU UNTUK
en: to talk

source: Daripada menghabiskan energi untuk memikirkan hal yang tidak dapat dirubah,
en: instead of wasting your energy to think about what you can’t change...

source: CARA AGAR BISA TAHU
en: chance to uncover

source: AARGH!
en: arghhh

source: Chiara, kembalilah ke ruang Wakasek bersama Cantika
en: chiara, go back to the vice principal office with cantika!

source: APA KAU YAKIN
en: Are you sure

source: Aku punya
en: I have

source: ITU HANYALAH
en: it’s only for

source: K-KAK KEVIN!?
en: K-Kevin?!

source: DAN APA SAJA
en: And... what

source: DIA SAMPAI
en: He couldn’t even

source: S-SORI,
en: S-sorry!
